{
  "sections": {
    "banner": {
      "type": "main-collection-banner",
      "disabled": true,
      "custom_css": [
        ".color-scheme-fcb3e455-8b9f-4f0d-a635-dbad1bff62f1 {display: flex; flex-direction: column;}"
      ],
      "settings": {
        "show_collection_description": true,
        "show_collection_image": true,
        "color_scheme": "scheme-fcb3e455-8b9f-4f0d-a635-dbad1bff62f1"
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "products_per_page": 8,
        "columns_desktop": 4,
        "color_scheme": "scheme-16ca31d7-439c-4285-96f8-821e7cd31b43",
        "image_ratio": "portrait",
        "image_shape": "default",
        "show_secondary_image": true,
        "show_vendor": false,
        "show_rating": true,
        "enable_quick_add": true,
        "enable_filtering": true,
        "filter_type": "drawer",
        "enable_sorting": true,
        "columns_mobile": "2",
        "padding_top": 48,
        "padding_bottom": 52
      }
    },
    "image_with_text_P8yEyp": {
      "type": "image-with-text",
      "blocks": {
        "heading_gyDJRQ": {
          "type": "heading",
          "settings": {
            "heading": "Midi Black Dressest  and Shopping Information.",
            "heading_size": "h2"
          }
        },
        "text_BFb9Kb": {
          "type": "text",
          "settings": {
            "text": "<p>Are midi dresses suitable for all heights and body types?<br\/><br\/>Yes, midi dresses are versatile and flattering for various heights and body types, as their length offers elegant coverage without being too short or long.<\/p><p><\/p>",
            "text_style": "body"
          }
        },
        "button_D9pQYP": {
          "type": "button",
          "settings": {
            "button_label": "Read More",
            "button_link": "shopify:\/\/pages\/all-about-dress",
            "button_style_secondary": true
          }
        }
      },
      "block_order": [
        "heading_gyDJRQ",
        "text_BFb9Kb",
        "button_D9pQYP"
      ],
      "settings": {
        "image": "shopify:\/\/shop_images\/Instagram_Historia_Fashion_2.png",
        "height": "adapt",
        "desktop_image_width": "small",
        "layout": "image_first",
        "desktop_content_position": "top",
        "desktop_content_alignment": "left",
        "content_layout": "no-overlap",
        "section_color_scheme": "scheme-16ca31d7-439c-4285-96f8-821e7cd31b43",
        "color_scheme": "scheme-16ca31d7-439c-4285-96f8-821e7cd31b43",
        "image_behavior": "none",
        "mobile_content_alignment": "left",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "collapsible_content_nmTHtp": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_row_ATTgzY": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Frequently asked questions and recommendations for a satisfactory shopping experience",
            "icon": "chat_bubble",
            "row_content": "<p>How do I choose the right size when buying a black midi dress online?<br\/><br\/> When selecting the size for your black midi dress, it is crucial to consult the size guide provided by our online store. Please measure your dimensions and compare them to the size chart to ensure a proper fit.<\/p><p>How do I ensure that the black midi dress I am purchasing is the desired length?<br\/><br\/>Please check the product description for the specific length of the black midi dress. Our store provides exact measurements, which will help you make sure the dress is the length you want.<\/p><p>What are the most recommended fabrics for a comfortable black midi dress?<br\/><br\/> Comfortable fabrics for a black midi dress include cotton, jersey, soft lace, or stretch blends. These materials provide comfort and mobility, ideal for long events or busy days.<\/p><p>Should I consider any specific styles when buying a formal black midi dress?<br\/><br\/>When looking for a black midi dress for formal occasions, consider elegant details like lace, subtle embellishments, or more structured cuts. These elements add a touch of sophistication suitable for more formal events.<\/p><p>Is it important to check the return policies before purchasing a black midi dress online?<br\/><br\/> It is essential to review the return policies before purchasing a black midi dress online. Make sure you know the return times, conditions and any associated charges to ensure a satisfactory experience<\/p><p>How can I make sure when shopping that the black midi dress is flattering for my body type?<br\/><br\/> When choosing a black midi dress, keep your body type in mind. For example, a dress with an empire waist can flatter many figures, while a pencil cut can highlight curves.<\/p><p>Is it advisable to buy black midi dresses with additional details such as slits or bows?<br\/><br\/> Choosing additional details on a black midi dress depends on your personal style. Slits or bows can add a unique and attractive touch to the dress. Please check the detailed images and description to make sure those items align with your preferences.<\/p><p>After having made my purchase, what is the best way to care for and maintain the quality of my black midi dress?<br\/><br\/>Review the instructions provided by the dress label. It is generally recommended to wash according to the washing instructions, avoid prolonged exposure to the sun, and store the dress properly to maintain its quality and shape over time.<\/p>",
            "page": ""
          }
        },
        "collapsible_row_GyAgYy": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Privacy Policy",
            "icon": "heart",
            "row_content": "<p><\/p><p>Violetta & RC's Privacy Policy details how personal information is collected via direct submissions, cookies, and third parties on their website. Collected data, such as contact details and orders, is utilized for services, marketing, and security.<\/p>",
            "page": ""
          }
        },
        "collapsible_row_YE8rD4": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Refund Policy",
            "icon": "return",
            "row_content": "<p><\/p><p>30-day return policy for unused items with tags. Damaged items inspected upon reception. Certain items, like perishables and custom products, are non-returnable. No returns on sale items or gift cards. Exchanges through separate purchases. EU customers have a 14-day cooling-off period. Refunds processed within 10 business days.<\/p>",
            "page": ""
          }
        },
        "collapsible_row_JdByU4": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Shipping Policy",
            "icon": "truck",
            "row_content": "<p><\/p><p>Orders processed in up to 3 days. Shipping details and costs revealed during checkout. Delivery times vary by location. Customers must provide accurate shipping details. Tracking info emailed upon shipment. Check packages for damage upon receipt. Shipping addresses cannot be changed post-processing; verify details before confirming<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_row_ATTgzY",
        "collapsible_row_GyAgYy",
        "collapsible_row_YE8rD4",
        "collapsible_row_JdByU4"
      ],
      "settings": {
        "caption": "",
        "heading": "FAQ and policies",
        "heading_size": "h1",
        "heading_alignment": "center",
        "layout": "none",
        "color_scheme": "scheme-16ca31d7-439c-4285-96f8-821e7cd31b43",
        "container_color_scheme": "",
        "open_first_collapsible_row": false,
        "image": "shopify:\/\/shop_images\/Fashion_2.png",
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 36,
        "padding_bottom": 36
      }
    }
  },
  "order": [
    "banner",
    "product-grid",
    "image_with_text_P8yEyp",
    "collapsible_content_nmTHtp"
  ]
}
